//正则验证函数
export default {
    //验证数字
    testNumber(val) {
        return {
            regex: /^\d+(\.\d+)?$/,
            result: /^\d+(\.\d+)?$/.test(val)
        };
    },
    //验证身份证
    testIDcard(val) {
        return {
            regex: /^\d{6}(18|19|20)?\d{2}(0[1-9]|1[012])(0[1-9]|[12]\d|3[01])\d{3}(\d|X)$/,
            result: /^\d{6}(18|19|20)?\d{2}(0[1-9]|1[012])(0[1-9]|[12]\d|3[01])\d{3}(\d|X)$/.test(val)
        };
    },
    //验证手机号
    testPhone(val) {
        return {
            regex: /^(13[0-9]|14[579]|15[0-3,5-9]|16[6]|17[0135678]|18[0-9]|19[89])\d{8}$/,
            result: /^(13[0-9]|14[579]|15[0-3,5-9]|16[6]|17[0135678]|18[0-9]|19[89])\d{8}$/.test(val)
        }
    }
}